rfblue2/pic-disassembler/src/include/p16f1784.inc
        LIST

;==========================================================================
;  MPASM PIC16F1784 processor include
; 
;  (c) Copyright 1999-2013 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC16F1784 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC16F1784
;       2. LIST directive in the source file
;               LIST   P=PIC16F1784
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __16F1784
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF



;==========================================================================
;
;       Register Definitions
;
;==========================================================================

W                EQU  H'0000'
F                EQU  H'0001'

;----- Register Files -----------------------------------------------------

;-----Bank0------------------
INDF0            EQU  H'0000'
INDF1            EQU  H'0001'
PCL              EQU  H'0002'
STATUS           EQU  H'0003'
FSR0             EQU  H'0004'
FSR0L            EQU  H'0004'
FSR0H            EQU  H'0005'
FSR1             EQU  H'0006'
FSR1L            EQU  H'0006'
FSR1H            EQU  H'0007'
BSR              EQU  H'0008'
WREG             EQU  H'0009'
PCLATH           EQU  H'000A'
INTCON           EQU  H'000B'
PORTA            EQU  H'000C'
PORTB            EQU  H'000D'
PORTC            EQU  H'000E'
PORTD            EQU  H'000F'
PORTE            EQU  H'0010'
PIR1             EQU  H'0011'
PIR2             EQU  H'0012'
PIR3             EQU  H'0013'
PIR4             EQU  H'0014'
TMR0             EQU  H'0015'
TMR1             EQU  H'0016'
TMR1L            EQU  H'0016'
TMR1H            EQU  H'0017'
T1CON            EQU  H'0018'
T1GCON           EQU  H'0019'
TMR2             EQU  H'001A'
PR2              EQU  H'001B'
T2CON            EQU  H'001C'

;-----Bank1------------------
TRISA            EQU  H'008C'
TRISB            EQU  H'008D'
TRISC            EQU  H'008E'
TRISD            EQU  H'008F'
TRISE            EQU  H'0090'
PIE1             EQU  H'0091'
PIE2             EQU  H'0092'
PIE3             EQU  H'0093'
PIE4             EQU  H'0094'
OPTION_REG       EQU  H'0095'
PCON             EQU  H'0096'
WDTCON           EQU  H'0097'
OSCTUNE          EQU  H'0098'
OSCCON           EQU  H'0099'
OSCSTAT          EQU  H'009A'
ADRES            EQU  H'009B'
ADRESL           EQU  H'009B'
ADRESH           EQU  H'009C'
ADCON0           EQU  H'009D'
ADCON1           EQU  H'009E'
ADCON2           EQU  H'009F'

;-----Bank2------------------
LATA             EQU  H'010C'
LATB             EQU  H'010D'
LATC             EQU  H'010E'
LATD             EQU  H'010F'
LATE             EQU  H'0110'
CM1CON0          EQU  H'0111'
CM1CON1          EQU  H'0112'
CM2CON0          EQU  H'0113'
CM2CON1          EQU  H'0114'
CMOUT            EQU  H'0115'
BORCON           EQU  H'0116'
FVRCON           EQU  H'0117'
DACCON0          EQU  H'0118'
DACCON1          EQU  H'0119'
CM4CON0          EQU  H'011A'
CM4CON1          EQU  H'011B'
APFCON2          EQU  H'011C'
APFCON           EQU  H'011D'
APFCON0          EQU  H'011D'
APFCON1          EQU  H'011D'
CM3CON0          EQU  H'011E'
CM3CON1          EQU  H'011F'

;-----Bank3------------------
ANSELA           EQU  H'018C'
ANSELB           EQU  H'018D'
ANSELD           EQU  H'018F'
ANSELE           EQU  H'0190'
EEADR            EQU  H'0191'
EEADRL           EQU  H'0191'
EEADRH           EQU  H'0192'
EEDAT            EQU  H'0193'
EEDATL           EQU  H'0193'
EEDATH           EQU  H'0194'
EECON1           EQU  H'0195'
EECON2           EQU  H'0196'
VREGCON          EQU  H'0197'
RC1REG           EQU  H'0199'
RCREG            EQU  H'0199'
RCREG1           EQU  H'0199'
TX1REG           EQU  H'019A'
TXREG            EQU  H'019A'
TXREG1           EQU  H'019A'
SP1BRG           EQU  H'019B'
SP1BRGL          EQU  H'019B'
SPBRG            EQU  H'019B'
SPBRG1           EQU  H'019B'
SPBRGL           EQU  H'019B'
SP1BRGH          EQU  H'019C'
SPBRGH           EQU  H'019C'
SPBRGH1          EQU  H'019C'
RC1STA           EQU  H'019D'
RCSTA            EQU  H'019D'
RCSTA1           EQU  H'019D'
TX1STA           EQU  H'019E'
TXSTA            EQU  H'019E'
TXSTA1           EQU  H'019E'
BAUD1CON         EQU  H'019F'
BAUDCON          EQU  H'019F'
BAUDCON1         EQU  H'019F'
BAUDCTL          EQU  H'019F'
BAUDCTL1         EQU  H'019F'

;-----Bank4------------------
WPUA             EQU  H'020C'
WPUB             EQU  H'020D'
WPUC             EQU  H'020E'
WPUD             EQU  H'020F'
WPUE             EQU  H'0210'
SSP1BUF          EQU  H'0211'
SSPBUF           EQU  H'0211'
SSP1ADD          EQU  H'0212'
SSPADD           EQU  H'0212'
SSP1MSK          EQU  H'0213'
SSPMSK           EQU  H'0213'
SSP1STAT         EQU  H'0214'
SSPSTAT          EQU  H'0214'
SSP1CON          EQU  H'0215'
SSPCON           EQU  H'0215'
SSP1CON2         EQU  H'0216'
SSPCON2          EQU  H'0216'
SSP1CON3         EQU  H'0217'
SSPCON3          EQU  H'0217'

;-----Bank5------------------
ODCONA           EQU  H'028C'
ODCONB           EQU  H'028D'
ODCONC           EQU  H'028E'
ODCOND           EQU  H'028F'
ODCONE           EQU  H'0290'
CCPR1            EQU  H'0291'
CCPR1L           EQU  H'0291'
CCPR1H           EQU  H'0292'
CCP1CON          EQU  H'0293'
CCPR2            EQU  H'0298'
CCPR2L           EQU  H'0298'
CCPR2H           EQU  H'0299'
CCP2CON          EQU  H'029A'

;-----Bank6------------------
SLRCONA          EQU  H'030C'
SLRCONB          EQU  H'030D'
SLRCONC          EQU  H'030E'
SLRCOND          EQU  H'030F'
SLRCONE          EQU  H'0310'
CCPR3            EQU  H'0311'
CCPR3L           EQU  H'0311'
CCPR3H           EQU  H'0312'
CCP3CON          EQU  H'0313'

;-----Bank7------------------
INLVLA           EQU  H'038C'
INLVLB           EQU  H'038D'
INLVLC           EQU  H'038E'
INLVLD           EQU  H'038F'
INLVLE           EQU  H'0390'
IOCAP            EQU  H'0391'
IOCAN            EQU  H'0392'
IOCAF            EQU  H'0393'
IOCBP            EQU  H'0394'
IOCBN            EQU  H'0395'
IOCBF            EQU  H'0396'
IOCCP            EQU  H'0397'
IOCCN            EQU  H'0398'
IOCCF            EQU  H'0399'
IOCEP            EQU  H'039D'
IOCEN            EQU  H'039E'
IOCEF            EQU  H'039F'

;-----Bank10------------------
OPA1CON          EQU  H'0511'
OPA2CON          EQU  H'0513'
CLKRCON          EQU  H'051A'

;-----Bank16------------------
PSMC1CON         EQU  H'0811'
PSMC1MDL         EQU  H'0812'
PSMC1SYNC        EQU  H'0813'
PSMC1CLK         EQU  H'0814'
PSMC1OEN         EQU  H'0815'
PSMC1POL         EQU  H'0816'
PSMC1BLNK        EQU  H'0817'
PSMC1REBS        EQU  H'0818'
PSMC1FEBS        EQU  H'0819'
PSMC1PHS         EQU  H'081A'
PSMC1DCS         EQU  H'081B'
PSMC1PRS         EQU  H'081C'
PSMC1ASDC        EQU  H'081D'
PSMC1ASDL        EQU  H'081E'
PSMC1ASDS        EQU  H'081F'
PSMC1INT         EQU  H'0820'
PSMC1PH          EQU  H'0821'
PSMC1PHL         EQU  H'0821'
PSMC1PHH         EQU  H'0822'
PSMC1DC          EQU  H'0823'
PSMC1DCL         EQU  H'0823'
PSMC1DCH         EQU  H'0824'
PSMC1PR          EQU  H'0825'
PSMC1PRL         EQU  H'0825'
PSMC1PRH         EQU  H'0826'
PSMC1TMR         EQU  H'0827'
PSMC1TMRL        EQU  H'0827'
PSMC1TMRH        EQU  H'0828'
PSMC1DBR         EQU  H'0829'
PSMC1DBF         EQU  H'082A'
PSMC1BLKR        EQU  H'082B'
PSMC1BLKF        EQU  H'082C'
PSMC1FFA         EQU  H'082D'
PSMC1STR0        EQU  H'082E'
PSMC1STR1        EQU  H'082F'
PSMC2CON         EQU  H'0831'
PSMC2MDL         EQU  H'0832'
PSMC2SYNC        EQU  H'0833'
PSMC2CLK         EQU  H'0834'
PSMC2OEN         EQU  H'0835'
PSMC2POL         EQU  H'0836'
PSMC2BLNK        EQU  H'0837'
PSMC2REBS        EQU  H'0838'
PSMC2FEBS        EQU  H'0839'
PSMC2PHS         EQU  H'083A'
PSMC2DCS         EQU  H'083B'
PSMC2PRS         EQU  H'083C'
PSMC2ASDC        EQU  H'083D'
PSMC2ASDL        EQU  H'083E'
PSMC2ASDS        EQU  H'083F'
PSMC2INT         EQU  H'0840'
PSMC2PH          EQU  H'0841'
PSMC2PHL         EQU  H'0841'
PSMC2PHH         EQU  H'0842'
PSMC2DC          EQU  H'0843'
PSMC2DCL         EQU  H'0843'
PSMC2DCH         EQU  H'0844'
PSMC2PR          EQU  H'0845'
PSMC2PRL         EQU  H'0845'
PSMC2PRH         EQU  H'0846'
PSMC2TMR         EQU  H'0847'
PSMC2TMRL        EQU  H'0847'
PSMC2TMRH        EQU  H'0848'
PSMC2DBR         EQU  H'0849'
PSMC2DBF         EQU  H'084A'
PSMC2BLKR        EQU  H'084B'
PSMC2BLKF        EQU  H'084C'
PSMC2FFA         EQU  H'084D'
PSMC2STR0        EQU  H'084E'
PSMC2STR1        EQU  H'084F'
PSMC3CON         EQU  H'0851'
PSMC3MDL         EQU  H'0852'
PSMC3SYNC        EQU  H'0853'
PSMC3CLK         EQU  H'0854'
PSMC3OEN         EQU  H'0855'
PSMC3POL         EQU  H'0856'
PSMC3BLNK        EQU  H'0857'
PSMC3REBS        EQU  H'0858'
PSMC3FEBS        EQU  H'0859'
PSMC3PHS         EQU  H'085A'
PSMC3DCS         EQU  H'085B'
PSMC3PRS         EQU  H'085C'
PSMC3ASDC        EQU  H'085D'
PSMC3ASDL        EQU  H'085E'
PSMC3ASDS        EQU  H'085F'
PSMC3INT         EQU  H'0860'
PSMC3PH          EQU  H'0861'
PSMC3PHL         EQU  H'0861'
PSMC3PHH         EQU  H'0862'
PSMC3DC          EQU  H'0863'
PSMC3DCL         EQU  H'0863'
PSMC3DCH         EQU  H'0864'
PSMC3PR          EQU  H'0865'
PSMC3PRL         EQU  H'0865'
PSMC3PRH         EQU  H'0866'
PSMC3TMR         EQU  H'0867'
PSMC3TMRL        EQU  H'0867'
PSMC3TMRH        EQU  H'0868'
PSMC3DBR         EQU  H'0869'
PSMC3DBF         EQU  H'086A'
PSMC3BLKR        EQU  H'086B'
PSMC3BLKF        EQU  H'086C'
PSMC3FFA         EQU  H'086D'
PSMC3STR0        EQU  H'086E'
PSMC3STR1        EQU  H'086F'

;-----Bank31------------------
STATUS_SHAD      EQU  H'0FE4'
WREG_SHAD        EQU  H'0FE5'
BSR_SHAD         EQU  H'0FE6'
PCLATH_SHAD      EQU  H'0FE7'
FSR0L_SHAD       EQU  H'0FE8'
FSR0H_SHAD       EQU  H'0FE9'
FSR1L_SHAD       EQU  H'0FEA'
FSR1H_SHAD       EQU  H'0FEB'
STKPTR           EQU  H'0FED'
TOSL             EQU  H'0FEE'
TOSH             EQU  H'0FEF'

;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NOT_PD           EQU  H'0003'
NOT_TO           EQU  H'0004'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'



;----- INTCON Bits -----------------------------------------------------
IOCIF            EQU  H'0000'
INTF             EQU  H'0001'
TMR0IF           EQU  H'0002'
IOCIE            EQU  H'0003'
INTE             EQU  H'0004'
TMR0IE           EQU  H'0005'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'

T0IF             EQU  H'0002'
T0IE             EQU  H'0005'


